-- HR 계정의 테이블을 사용한 GROUP BY, JOIN, SUB QUERY 연습

-- 1. 직원의 last_name과 부서 이름을 검색.

-- 2. 직원의 last_name과 부서 이름을 검색. 부서 번호가 없는 직원도 출력.

-- 3. 직원의 last_name과 직책 이름(job title)을 검색.

-- 4. 직원의 last_name과 직원이 근무하는 도시 이름(city)를 검색.

-- 5. 직원의 last_name과 직원이 근무하는 도시 이름(city)를 검색.
-- 근무 도시를 알 수 없는 직원도 출력.

-- 6. 2008년에 입사한 직원들의 last_name을 검색.

-- 7. 2008년에 입사한 직원들의 부서 이름과 부서별 인원수 검색.


-- 8. 2008년에 입사한 직원들의 부서 이름과 부서별 인원수 검색. 
-- 단, 부서별 인원수가 5명 이상인 경우만 출력.

-- 9. 부서번호, 부서별 급여 평균을 검색. 소숫점 한자리까지 반올림 출력.

-- 10. 부서별 급여 평균이 최대인 부서의 부서번호, 급여 평균을 검색.

-- 11. 사번, 직원이름, 국가이름, 급여 검색.

-- 12. 국가이름, 국가별 급여 합계 검색.

-- 13. 사번, 직원이름, 직책이름, 급여를 검색.

-- 14. 직책이름, 직책별 급여 평균, 최솟값, 최댓값 검색.

-- 15. 국가이름, 직책이름, 국가별 직책별 급여 평균 검색.

-- 16. 국가이름, 직책이름, 국가별 직책별 급여 합계을 출력.
-- 미국에서, 국가별 직책별 급여 합계가 50,000 이상인 레코드만 출력.
